//
export default {
	solar: {
		d0214: "情人节",
		d0308: "妇女节",
		d0401: "愚人节",
		d0422: "地球日",
		d0501: "劳动节",
		d0504: "青年节",
		d0601: "儿童节",
		d0801: "建军节",
		d0910: "教师节",
		d1001: "国庆节",
		d1122: "感恩节",
		d1224: "平安夜",
		d1225: "圣诞节"
	},
	
	lunar: {
		// d11: "元旦",
		d1208: "腊八",
		d1223: "小年",
		// d1229: "除夕",
		d1230: "除夕",
		d0101: "春节",
		d0115: "元宵",
		// d318: "龙抬头",
		d0505: "端午",
		d0707: "七夕",
		d0715: "中元节",
		d0815: "中秋节",
		d0909: "重阳节"
	}
}

/**
 * 中国的传统节日有:
 * 除夕（腊月最后一天）
 * 春节（正月初一）
 * 元宵节（正月十五）
 * 寒食节（清明节前一天）
 * 清明节（阳历：4月5日前后）
 * 上巳节（农历：三月初三）
 * 端午节（农历：五月初五）
 * 七夕节（农历：七月初七）
 * 中秋节（农历：八月十五）
 * 重阳节（农历：九月九）
 * 寒衣节（农历：十月初一）
 * 腊八节（农历：腊月初八）
 * 小年（腊月二十三 ~ 腊月二十四） 
 * 等
 */